<?php

return [
    'lang' => 'ru',
    'title' => 'Шаян Максим Александрович',
    'name' => 'Шаян Максим',
    'load' => 'Загрузка',
    'nav' => [
        'about' => 'Обо мне',
        'skills' => 'Навыки',
        'education' => 'Образование',
        'experience' => 'Опыт работы',
        'services' => 'Услуги',
        'portfolio' => 'Портфолио',
        'testimonials' => 'Отзывы',
        'contact' => 'Контакты', //Contact me
    ],
    'pages' => [
        'about' => [
            'title' => 'Обо мне',
            'name' => 'Максим Шаян',
            'profession' => 'Веб-разработчик',
            'text' => 'Я проработал веб-разработчиком и инженером более 9 лет. 
            На протяжении этого времени я успел создать много различных веб-приложений. 
            Я постоянно нахожусь в процессе изучения новых навыков. 
            Мне кажется, что будущее любого бизнеса за автоматизацией, а веб-технологии помогают в этом как нельзя лучше.',
            'download_cv' => 'Загрузить Резюме',
            'contact_me_text' => 'Я открыт для любой работы и предложений.',
            'contact_me_button' => 'Свяжитесь со мной',
        ],
        'skills' => [
            'title' => 'Навыки',
            'years_exp' => 'опыта',
            'skills' => [
                [
                    'name' => 'PHP',
                    'years' => '8+ лет',
                    'percentage' => 95,
                ],
                [
                    'name' => 'MySQL',
                    'years' => '8+ лет',
                    'percentage' => 90,
                ],
                [
                    'name' => 'HTML5, CSS3',
                    'years' => '5+ лет',
                    'percentage' => 90,
                ],
                [
                    'name' => 'JavaScript, JQuery',
                    'years' => '5+ лет',
                    'percentage' => 80,
                ],
                [
                    'name' => 'Laravel',
                    'years' => '2+ года',
                    'percentage' => 90,
                ],
                [
                    'name' => 'Vue.js',
                    'years' => '1+ год',
                    'percentage' => 60,
                ],
                [
                    'name' => 'Git, Composers',
                    'years' => '4+ года',
                    'percentage' => 85,
                ],
                [
                    'name' => 'NPM, WebPack',
                    'years' => '1+ год',
                    'percentage' => 50,
                ],
                [
                    'name' => 'Linux, Apache',
                    'years' => '8+ лет',
                    'percentage' => 50,
                ],
            ]
        ],
        'education' => [
            'title' => 'Образование',
            'qualification_title' => 'Инженер',
            'qualification' => 'Инженер инфо-телекоммуникаций',
            'years' => '2005-2010',
            'institution' => 'Сибирский Федеральный Университет. Кафедра сетей связи и систем коммутаций.',
        ],
        'experience' => [
            'title' => 'Опыт работы',
            'experiences' => [
                [
                    'name' => 'Старший веб-разработчик',
                    'duration' => '2019-настоящее время',
                    'company' => 'ООО "Техномаркет"',
                    'description' => 'Разработка веб-приложений по техническому заданию заказчика.
                    Координации работы команды разработчиков.',
                ],
                [
                    'name' => 'Главный эксперт',
                    'duration' => '08.2014-08.2019',
                    'company' => 'АО "МУС Энергетики"',
                    'description' => 'Разработка программного обеспечения для управления, мониторинга и конфигурации
                    оборудования сети передачи данных и автоматизации процессов анализа работоспособности оборудования, а также
                    разработка систем автоматизации, документооборота и формирования отчетов с использованием веб-технологий.',
                ],
                [
                    'name' => 'Главный специалист',
                    'duration' => '04.2012-08.2014',
                    'company' => 'АО "МУС Энергетики"',
                    'description' => 'Разработка программного обеспечения по автоматизации управления и конфигурации
                    оборудования сети передачи данных и бесперебойного электропитания с использованием веб-технологий.',
                ],
                [
                    'name' => 'Ведущий специалист',
                    'duration' => '11.2010-04.2012',
                    'company' => 'ОАО "МУС Энергетики"',
                    'description' => 'Обслуживание и управление сетью связи.
                    а также разработка программного обеспечения для мониторинга оборудования сети передачи данных.',
                ],
                [
                    'name' => 'Инженер тех. поддержки',
                    'duration' => '08.2010-11.2010',
                    'company' => 'ОАО "Ростелеком"',
                    'description' => 'Техническая поддержка абонентов сети передачи данных Российского провайдера.
                    Поиск и устранение неисправностей на оборудовании широкополосного доступа.',
                ],
            ]
        ],
        'services' => [
            'title' => 'Предоставляю услуги',
            'services' => [
                [
                    'icon' => 'website',
                    'name' => 'Разработка сайтов, лендингов',
                    'description' => 'Разрабатываю сайты любой сложности и функционала.
                    Своим клиентам я всегда помогаю проработать также и дизайн.',
                ],
                [
                    'icon' => 'code-alt',
                    'name' => 'Написание скриптов и ботов',
                    'description' => 'Вам нужно подключить систему оплаты, загрузить данные от поставщика,
                    автоматизировать рассылку, или что-то еще? Обращайтесь.',
                ],
                [
                    'icon' => 'book',
                    'name' => 'Обучение веб-программированию',
                    'description' => 'Обучаю HTML, CSS, PHP, JavaScript.
                    Имею опыт обучения студентов колледжей и университетов и руководства дипломными проектами.',
                ],
                [
                    'icon' => 'cog',
                    'name' => 'Веб-приложения автоматизации бизнеса',
                    'description' => 'У Вас есть свой бизнес? Помогаю внедрить системы для автоматизации внутренних процессов
                    и высвобождения времени сотрудников.',
                ],
                [
                    'icon' => 'text-format',
                    'name' => 'Обучение Английскому языку',
                    'description' => 'Делюсь опытом и даю работающие советы как выучить Английскй.
                    Сам я практически с нуля стал свободно на нем общаться за 2 года.',
                ],
                [
                    'icon' => 'cloud',
                    'name' => 'Настройка сетевого оборудования',
                    'description' => 'Осуществляю настройку оборудования связи и локальных сетей.',
                ],
            ],
        ],
        'testimonials' => [
            'title' => 'Отзывы',
            'open_link' => 'Открыть',
            'testimonials' => [
                [
                    'photo' => 'kovchin.jpg',
                    'name' => 'Ковчин Павел',
                    'position' => 'Начальник ОТС',
                    'company' => 'АО "МУС Энергетики"',
                    'link' => 'https://eesnet.ru',
                    'text' => 'Как специалист он проявил себя как ответственный, пунктуальный, нацеленный на результат, сотрудник,
                    проявляющий инициативу и предлагающий оригинальные решения, постоянно находится в поиске новых идей для реализации
                    имеющихся задач с целью сокращения издержек производства и оптимизации рабочего процесса. Старается держать свои 
                    профессиональные навыки в актуальном к рынку состоянии, занимается саморазвитием.'
                ],
                [
                    'photo' => 'texno.jpg',
                    'name' => 'Сумберт Дмитрий',
                    'position' => 'Директор',
                    'company' => 'ООО Техномаркет',
                    'link' => 'https://texno24.ru',
                    'text' => 'С Максимом успели поработать над многими задачами. На него точно можно положиться.
                    Даже когда возникают сложные задачи, или непредвиденные ситуации, он всегда находит решение.
                    Я на 100% уверен в этом человеке за его ответственный подход к делу и уровень как специалиста.'
                ],
                [
                    'photo' => 'ushkalova.jpg',
                    'name' => 'Ушкалова Ольга',
                    'position' => 'Директор',
                    'company' => 'Softpear',
                    'link' => 'https://softpear.ru',
                    'text' => 'Работа была сделана быстро ( в тот же день) и качественно. 
                    Профессиональный подход к задаче, приятное общение. 
                    Агрументированные советы по дальнейшим исправлениям на сайте и рекомендации. 
                    Надеюсь дальнейшая работа будет также успешна!'
                ],
                [
                    'photo' => 'no_photo.jpg',
                    'name' => 'Анжелика Титова',
                    'position' => 'Директор',
                    'company' => 'Интернет-магазин',
                    'link' => '',
                    'text' => 'Работа выполнена менее чем за сутки (на выполнение было отведено трое суток). 
                    Отличительная черта Максима- работа на результат, а не ради процесса. 
                    Именно благодаря этому, удалось понять суть проблемы, и решить ее. 
                    Видео инструкция максимально детализирована, помимо основного задания предложил и помог 
                    внедрить дополнительные инструменты для достижения результата. 
                    После окончания проекта продолжает осуществлять консультативную помощь. 
                    Спасибо, и рекомендую.'
                ],

            ]
        ],
        'portfolio' => [
            'title' => 'Портфолио',
            'all' => 'Все',
            'categories' => [
                [
                    'name' => 'Онлайн Сервисы',
                    'code' => 'services',
                ],
                [
                    'name' => 'Софт',
                    'code' => 'software',
                ],
                [
                    'name' => 'Сайты',
                    'code' => 'sites',
                ],
                [
                    'name' => 'Скрипты и модули',
                    'code' => 'scripts',
                ],
            ],
            'contents' => [
                [
                    'category_code' => 'sites',
                    'link' => 'https://texno24.ru',
                    'image' => 'texno24.ru.jpg',
                    'text' => 'Сайт компании ООО "Техномаркет"',
                ],
                [
                    'category_code' => 'sites',
                    'link' => 'http://charity.shaian.ru',
                    'image' => 'charity.shaian.ru.jpg',
                    'text' => 'Сайт благотворительного фонда Вячеслава Бронникова',
                ],
                [
                    'category_code' => 'sites',
                    'link' => 'https://softpear.ru',
                    'image' => 'softpear.ru.jpg',
                    'text' => 'Интернет-магазин безкаркасной мебели (OCStore)',
                ],
                [
                    'category_code' => 'sites',
                    'link' => 'https://shaian.ru/demos/bookshelf',
                    'image' => 'bookshelf.jpg',
                    'text' => 'Интернет-магазин детской литературы (OCStore)',
                ],
                [
                    'category_code' => 'services',
                    'link' => 'https://format.net.ru',
                    'image' => 'widget.jpg',
                    'text' => 'Приложение "Виджет Отзывов на сайт"',
                ],
                [
                    'category_code' => 'services',
                    'link' => 'https://shaian.ru/demos/oprosnik',
                    'image' => 'oprosnik.jpg',
                    'text' => 'Приложение "Опросник" для сбора мнения и данных клиентов',
                ],
                [
                    'category_code' => 'services',
                    'link' => 'https://shaian.online',
                    'image' => 'math.jpg',
                    'text' => 'Приложение "Тренировка математики для детей" (Demo)',
                ],
                [
                    'category_code' => 'services',
                    'link' => 'https://podarimne.site',
                    'image' => 'podarimne.jpg',
                    'text' => 'Онлайн-сервис составления списка подарков',
                ],
                [
                    'category_code' => 'services',
                    'link' => 'https://thedroid.ru/viewer/schedule.php',
                    'image' => 'thedroid.jpg',
                    'text' => 'Внутренний сервис контроля выполнения работ, генерации документов и формирования отчетов для компании АО "МУС Энергетики" - "The Droid"',
                ],
                [
                    'category_code' => 'services',
                    'link' => 'https://bloodbowl.ru',
                    'image' => 'bloodbowl.jpg',
                    'text' => 'Сервис проведения соревнований настольной игры BloodBowl',
                ],
                [
                    'category_code' => 'software',
                    'link' => 'https://softmonitor.shaian.ru',
                    'image' => 'soft_monitor.jpg',
                    'text' => 'Система мониторинга оборудования передачи данных и электропитания "SoftMonitor"',
                ],
                [
                    'category_code' => 'software',
                    'link' => 'https://github.com/vanguardkras/android_app_translator',
                    'image' => 'gear.jpg',
                    'text' => 'Переводчик Android приложений',
                ],
                [
                    'category_code' => 'software',
                    'link' => 'https://github.com/vanguardkras/cisco_php_configuration_samples',
                    'image' => 'gear.jpg',
                    'text' => 'Конфигуратор оборудования cisco АО "МУС Энергетики" (Примеры)',
                ],
                [
                    'category_code' => 'scripts',
                    'link' => 'https://github.com/vanguardkras/debug',
                    'image' => 'gear.jpg',
                    'text' => 'PHP функция debug() вместо print_r() и var_dump() (composer)',
                ],
                [
                    'category_code' => 'scripts',
                    'link' => 'https://github.com/vanguardkras/laravel-simple-articles',
                    'image' => 'gear.jpg',
                    'text' => 'Пакет Laravel для создания страницы статей и админки (composer)',
                ],
                [
                    'category_code' => 'scripts',
                    'link' => 'https://techtips.ru/speed/edinitsy-skorosti-interneta/#kalkulyator-perevoda-velichin',
                    'image' => 'gear.jpg',
                    'text' => 'Конвертер размера данных (JS)',
                ],
                [
                    'category_code' => 'scripts',
                    'link' => 'https://github.com/vanguardkras/simplegoogleauth',
                    'image' => 'gear.jpg',
                    'text' => 'Адаптер для авторизации Google (composer)',
                ],
                [
                    'category_code' => 'scripts',
                    'link' => 'https://github.com/vanguardkras/tablebuilder',
                    'image' => 'gear.jpg',
                    'text' => 'Библиотека для построения и редактирования таблиц из MySQL на страницу (в целях ускорения написания простых приложений) (composer)',
                ],
            ],
        ]
    ]

];